luka1995/EVCC-Type2-Controller/LPC82X SW V1/Sources/TYPE_2_CONTROLLER_LPC824_V1_KEIL5.c
/*----------------------------------------------------------------------------
 *      Type 2 Controller LPC824
 *			Copyright 2015
 *			Luka Penger
 *			Avant Car d.o.o.
 *---------------------------------------------------------------------------*/

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <ctype.h>
#include <LPC82x.h>

#include "cmsis_os.h"
#include <GPIO_LPC82x.h>
#include <ADC_LPC82x.h>
#include <IAP_LPC82x.h>
#include "SETTINGS.h"
#include "EV_UART.h"
#include "EV_PWM.h"
#include "EV_ADC.h"
#include "EV_STATE_MACHINE.h"
#include "EV_OUTPUTS.h"
#include "EV_INPUTS.h"

/*****************************************************************************
 * Definitions
 ****************************************************************************/

#define FIRMWARE_VERSION												"1.0"

#define DEFAULT_MODULE_ADDRESS									0
#define MODULE_ADDRESS_MAX_NUMBER								9999

#define ADC_SAMPLE_INTERVAL											50 // ms / when pwm = false
#define STATE_MACHINE_INTERVAL									50 // ms

/*****************************************************************************
 * Public variables
 ****************************************************************************/

extern SETTINGS_Struct settingsData;

extern EvModuleMode selectedModuleMode;

extern char EV_UART_Buffer[EV_UART_BUFFER_SIZE];
extern int EV_UART_BufferLength;
extern bool EV_UART_DataReceived;

extern float selectedMaximumCurrent;
extern bool pwmRunning;
extern float evPwmDutyCycle;

extern bool thresholdCrossed, sequenceComplete;
extern bool groundError;
extern int pilotPositiveADCValue; // 0 - 4095
extern int pilotNegativeADCValue; // 0 - 4095
extern float pilotPositiveVoltage; // 0.0V - 12.0V
extern float pilotNegativeVoltage; // 0.0V - -12.0V
extern bool adcVoltageMeasured;

extern void (*currentStateMachine)(void);
extern int evStateMachineWaitMs;
extern bool manualStartChargingFlag;

int ledWaitMs = 0;

/*****************************************************************************
 * Private variables
 ****************************************************************************/


/*****************************************************************************
 * Thread definitions
 ****************************************************************************/

/*****************************************************************************
 * Public functions
 ****************************************************************************/


/*****************************************************************************
 * Private functions
 ****************************************************************************/

void init(void) {
	SystemInit();
	SystemCoreClockUpdate();
	
	/*
	1 = 1s
	10 = 100ms
	100 = 10ms
	1000 = 1ms*/
	SysTick_Config(SystemCoreClock / 1000);
	
	// EV Init
	
	EV_OUTPUTS_Init();
	
	EV_INPUTS_Init();

	EV_UART_Init();
	
	EV_PWM_Init();
	
	EV_ADC_Init();
	
	// Settings load
	
	SETTINGS_Load();
	
	// Default state machine
	
	EV_State_A1();
}

/*****************************************************************************
 * Main
 ****************************************************************************/

int main(void) {
	//
	// Variables
	//
	char *evUartModuleAddressString = NULL, *evUartFunctionString = NULL, *evUartValueString = NULL;
	int evUartModuleAddressSpaceIndex = 0, evUartFunctionSpaceIndex = 0;
	int evUartModuleAddressNumber = 0, evUartFunctionNumber = 0, evUartValueNumber = 0;
	bool evUartShowCommandError = false;
	int sysTickAdcSampleValue = 0, sysTickStateMachineValue = 0;
	
	//
	// Init
	//
 	init();
	
	// Send firmware version
	
	EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, 2);
	EV_UART_SendString(" V"FIRMWARE_VERSION);
	EV_UART_SendString("\r\n");
	
	// Set maximum current
	
	selectedMaximumCurrent = settingsData.selectedIdefault;
	EV_PWM_SetDutyCycle(selectedMaximumCurrent);
	
	//
	// While
	//
	while (1) {
		/*****************************************************************************
		* ADC Voltage Read
		****************************************************************************/
		
		if (sequenceComplete == true) {
			sequenceComplete = false; // Clear flag
			
			// Read CP Voltage
			
			EV_ADC_ReadCPVoltage();
	  }
		
		/*****************************************************************************
		* SysTick Value Listener
		****************************************************************************/

		if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
			// ADC Sequencer
			
			if (pwmRunning == false) {
				if (sysTickAdcSampleValue >= ADC_SAMPLE_INTERVAL) {
					sysTickAdcSampleValue = 0; // Clear flag

					ADC_StartSequencer(LPC_ADC, ADC_SEQA_IDX);
				} else {
					sysTickAdcSampleValue++;
				}
			}
			
			// EV State Machine
			
			if (adcVoltageMeasured && sysTickStateMachineValue >= STATE_MACHINE_INTERVAL) {
				sysTickStateMachineValue = 0; // Clear flag

				// State machine
			
				EV_State_Machine();
			} else {
				sysTickStateMachineValue++;
			}
			
			if (evStateMachineWaitMs > 0) {
				evStateMachineWaitMs--;
			}
			
			// LED States
			
			if (ledWaitMs == 0) {
				if (currentStateMachine == EV_State_A1 || currentStateMachine == EV_State_A2) {
					ledWaitMs = 1000; // Only for disable setting led no 1ms
					
					EV_OUTPUTS_SetLED2(false);
					EV_OUTPUTS_SetLED1(false);
				} else if (currentStateMachine == EV_State_B1 || currentStateMachine == EV_State_B2) {
					ledWaitMs = 1000; // Only for disable setting led no 1ms
					
					EV_OUTPUTS_SetLED2(false);
					EV_OUTPUTS_SetLED1(true);
				} else if (currentStateMachine == EV_State_C1 || currentStateMachine == EV_State_C2) {
					ledWaitMs = 1000; // Only for disable setting led no 1ms
					
					EV_OUTPUTS_SetLED2(true);
					EV_OUTPUTS_SetLED1(false);
				} else if (currentStateMachine == EV_State_D1 || currentStateMachine == EV_State_D2) {
					ledWaitMs = 1000;
					
					EV_OUTPUTS_SetLED2(true);
					EV_OUTPUTS_SetLED1(true);
				} else if (currentStateMachine == EV_State_E || currentStateMachine == EV_State_F) {
					ledWaitMs = 2000;
					
					if (EV_OUTPUTS_GetStateLED1()) {
						EV_OUTPUTS_SetLED2(false);
						EV_OUTPUTS_SetLED1(false);
					} else {
						EV_OUTPUTS_SetLED2(true);
						EV_OUTPUTS_SetLED1(true);
					}
				}
			} else {
				ledWaitMs--;
			}
		}
		
		/*****************************************************************************
		* EV UART Listener
		****************************************************************************/
		
		if (EV_UART_DataReceived == true && (UART_GetStatus(EV_UART) & UART_STAT_RXIDLE) != 0 && (UART_GetStatus(EV_UART) & UART_STAT_RXRDY) == 0) {
			EV_UART_DataReceived = false;

