luka1995/EVCC-Type2-Controller/LPC82X SW V1/Sources/TYPE_2_CONTROLLER_LPC824_V1_KEIL5.c
			// Search MODULE ADDRESS space index
			evUartModuleAddressSpaceIndex = EV_UART_LocateCharacter(EV_UART_Buffer, EV_UART_BufferLength, 0x20, 0);
			
			if (evUartModuleAddressSpaceIndex > 0) {
				evUartModuleAddressString = (char *)malloc(evUartModuleAddressSpaceIndex);
				strncpy(evUartModuleAddressString, EV_UART_Buffer, evUartModuleAddressSpaceIndex);
				
				if (EV_UART_BufferIsNumber(evUartModuleAddressString, evUartModuleAddressSpaceIndex) == true) {
					evUartModuleAddressNumber = atoi(evUartModuleAddressString);
					
					// Free pointer
					if (evUartModuleAddressString != NULL) { free(evUartModuleAddressString); evUartModuleAddressString = NULL; }
					
					// Check module address if correct
					if (evUartModuleAddressNumber == DEFAULT_MODULE_ADDRESS || evUartModuleAddressNumber == settingsData.selectedModuleAddress) {
						// MODULE ADDRESS IS CORRECT

						// Search FUNCTION space index
						evUartFunctionSpaceIndex = EV_UART_LocateCharacter(EV_UART_Buffer, EV_UART_BufferLength, 0x20, 1);
						
						if (evUartFunctionSpaceIndex > 0) {
							evUartFunctionString = (char *)malloc(evUartFunctionSpaceIndex - (evUartModuleAddressSpaceIndex + 1));
							strncpy(evUartFunctionString, EV_UART_Buffer + (evUartModuleAddressSpaceIndex + 1), (evUartFunctionSpaceIndex - (evUartModuleAddressSpaceIndex + 1)));
							
							// COMMAND WITH VALUE
							if (EV_UART_BufferIsNumber(evUartFunctionString, (evUartFunctionSpaceIndex - (evUartModuleAddressSpaceIndex + 1))) == true) {
								evUartFunctionNumber = atoi(evUartFunctionString);
								
								// Free pointer
								if (evUartFunctionString != NULL) { free(evUartFunctionString); evUartFunctionString = NULL; }
								
								// Search VALUE
								evUartValueString = (char *)malloc(EV_UART_BufferLength - (evUartFunctionSpaceIndex + 1));
								strncpy(evUartValueString, EV_UART_Buffer + (evUartFunctionSpaceIndex + 1), (EV_UART_BufferLength - (evUartFunctionSpaceIndex + 1)));
							
								if (EV_UART_BufferIsNumber(evUartValueString, (EV_UART_BufferLength - (evUartFunctionSpaceIndex + 1))) == true) {
									evUartValueNumber = atoi(evUartValueString);
								
									// Free pointer
									if (evUartValueString != NULL) { free(evUartValueString); evUartValueString = NULL; }
	
									// Functions
									
									switch (evUartFunctionNumber) {
										case 3: { // SET ADDRESS OF DEVICE
											if (evUartValueNumber >= 1 && evUartValueNumber >= MODULE_ADDRESS_MAX_NUMBER) {
												settingsData.selectedModuleAddress = evUartValueNumber;
												
												SETTINGS_Save();
												
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else { // VALUE NOT CORRECT
												evUartShowCommandError = true;
											}
											break;
										}
										case 9: { // SET OUTPUT
											/*switch (evUartValueNumber) {
												case 1: {
													EV_OUTPUTS_SetLED1(true);
													break;
												}
												case 2: {
													EV_OUTPUTS_SetLED2(true);
													break;
												}
												case 4: {
													EV_OUTPUTS_SetPower(true);
													break;
												}
												case 8: {
													EV_OUTPUTS_SetVentilation(true);
													break;
												}
												case 16: {
													EV_OUTPUTS_SetShut(true);
													break;
												}
												default: {
													evUartShowCommandError = true;
													break;
												}
											}*/
											break;
										}
										case 10: { // CLEAR OUTPUT
											/*switch (evUartValueNumber) {
												case 1: {
													EV_OUTPUTS_SetLED1(false);
													break;
												}
												case 2: {
													EV_OUTPUTS_SetLED2(false);
													break;
												}
												case 4: {
													EV_OUTPUTS_SetPower(false);
													break;
												}
												case 8: {
													EV_OUTPUTS_SetVentilation(false);
													break;
												}
												case 16: {
													EV_OUTPUTS_SetShut(false);
													break;
												}
												default: {
													evUartShowCommandError = true;
													break;
												}
											}*/
											break;
										}
										case 16: { // SET Ic MAX
											if (evUartValueNumber >= 0 && evUartValueNumber <= (EV_PWM_MAXIMUM_DUTY_CICLE * 10)) {
												switch (evUartValueNumber) {
													case 0: { // 6A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_6A);
														break;
													}
													case 1: { // 10A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_10A);
														break;
													}
													case 2: { // 13A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_13A);
														break;
													}
													case 3: { // 16A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_16A);
														break;
													}
													case 4: { // 20A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_20A);
														break;
													}
													case 5: { // 32A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_32A);
														break;
													}
													case 6: { // 40A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_40A);
														break;
													}
													case 7: { // 50A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_50A);
														break;
													}
													case 8: { // 60A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_60A);
														break;
													}
													case 9: { // 70A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_70A);
														break;
													}
													case 10: { // 80A
														EV_PWM_SetDutyCycle(EV_CURRENT_PWM_DUTY_80A);
														break;
													}
													case 11: { // Idefault
														EV_PWM_SetDutyCycle(settingsData.selectedIdefault);
														break;
													}
													default: {
														EV_PWM_SetDutyCycle((float)((float)evUartValueNumber / 10));
														break;
													}
												}
												
