luka1995/EVCC-Type2-Controller/LPC82X SW V1/Sources/TYPE_2_CONTROLLER_LPC824_V1_KEIL5.c
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else { // VALUE NOT CORRECT
												evUartShowCommandError = true;
											}
											break;
										}
										case 17: { // SET Idefault
											if (evUartValueNumber >= 0 && evUartValueNumber <= (EV_PWM_MAXIMUM_DUTY_CICLE * 10)) {
												switch (evUartValueNumber) {
													case 0: { // 6A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_6A;
														break;
													}
													case 1: { // 10A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_10A;
														break;
													}
													case 2: { // 13A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_13A;
														break;
													}
													case 3: { // 16A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_16A;
														break;
													}
													case 4: { // 20A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_20A;
														break;
													}
													case 5: { // 32A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_32A;
														break;
													}
													case 6: { // 40A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_40A;
														break;
													}
													case 7: { // 50A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_50A;
														break;
													}
													case 8: { // 60A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_60A;
														break;
													}
													case 9: { // 70A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_70A;
														break;
													}
													case 10: { // 80A
														settingsData.selectedIdefault = EV_CURRENT_PWM_DUTY_80A;
														break;
													}
													default: {
														settingsData.selectedIdefault = (float)((float)evUartValueNumber / 10);
														break;
													}
												}
												
												SETTINGS_Save();
												
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else { // VALUE NOT CORRECT
												evUartShowCommandError = true;
											}
											break;
										}
										default: { // THIS FUNCTION DOESNT EXISTS
											evUartShowCommandError = true;
											break;
										}
									}
								} else { // VALUE NOT CORRECT
									evUartShowCommandError = true;
								}
							} else { // FUNCTION NOT CORRECT
								evUartShowCommandError = true;
							}
						} else {
							evUartFunctionString = (char *)malloc(EV_UART_BufferLength - (evUartModuleAddressSpaceIndex + 1));
							strncpy(evUartFunctionString, EV_UART_Buffer + (evUartModuleAddressSpaceIndex + 1), (EV_UART_BufferLength - (evUartModuleAddressSpaceIndex + 1)));
							
							// COMMAND WITHOUT VALUE
							if (EV_UART_BufferIsNumber(evUartFunctionString, (EV_UART_BufferLength - (evUartModuleAddressSpaceIndex + 1))) == true) {
								evUartFunctionNumber = atoi(evUartFunctionString);
								
								// Free pointer
								if (evUartFunctionString != NULL) { free(evUartFunctionString); evUartFunctionString = NULL; }
	
								// Functions
								
								switch (evUartFunctionNumber) {
									case 0: { // RESET DEVICE
										NVIC_SystemReset();
										break;
									}
									case 1: { // LOAD FACTORY SETTINGS AND RESET DEVICE
										SETTINGS_LoadFactorySettings();

										NVIC_SystemReset();
										break;
									}
									case 2: { // GET VERSION OF FIRMWARE
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendString(" V"FIRMWARE_VERSION);
										EV_UART_SendString("\r\n");
										break;
									}
									case 4: { // GET ADDRESS OF DEVICE
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", settingsData.selectedModuleAddress);
										EV_UART_SendString("\r\n");
										break;
									}
									case 5: { // GET STATE MACHINE MODE
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										
										if (currentStateMachine == EV_State_A1) {
											EV_UART_SendStringFormat(" 0");
										} else if (currentStateMachine == EV_State_A2) {
											EV_UART_SendStringFormat(" 1");
										} else if (currentStateMachine == EV_State_B1) {
											EV_UART_SendStringFormat(" 2");
										} else if (currentStateMachine == EV_State_B2) {
											EV_UART_SendStringFormat(" 3");
										} else if (currentStateMachine == EV_State_C1) {
											EV_UART_SendStringFormat(" 4");
										} else if (currentStateMachine == EV_State_C2) {
											EV_UART_SendStringFormat(" 5");
										} else if (currentStateMachine == EV_State_D1) {
											EV_UART_SendStringFormat(" 6");
										} else if (currentStateMachine == EV_State_D2) {
											EV_UART_SendStringFormat(" 7");
										} else if (currentStateMachine == EV_State_E) {
											EV_UART_SendStringFormat(" 8");
										} else if (currentStateMachine == EV_State_F) {
											EV_UART_SendStringFormat(" 9");
										}
										
										EV_UART_SendString("\r\n");
										break;
									}
									case 6: { // SWITCH MODE TO MANUAL (Stop charging)
										selectedModuleMode = kEvModuleModeManual;
										
										if (currentStateMachine == EV_State_C2) {
											EV_State_C1();
										} else if (currentStateMachine == EV_State_D2) {
											EV_State_D1();
										}
										
