luka1995/EVCC-Type2-Controller/LPC82X SW V1/Sources/TYPE_2_CONTROLLER_LPC824_V1_KEIL5.c
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendString("\r\n");
										break;
									}
									case 7: { // SWITCH MODE TO AUTO (Stop charging)
										selectedModuleMode = kEvModuleModeAuto;
										
										if (currentStateMachine == EV_State_C2) {
											EV_State_C1();
										} else if (currentStateMachine == EV_State_D2) {
											EV_State_D1();
										}
										
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendString("\r\n");
										break;
									}
									case 8: { // GET STATUS OF OUTPUT
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", ((EV_OUTPUTS_GetStateShut() << 4) + (EV_OUTPUTS_GetStateVentilation() << 3) + (EV_OUTPUTS_GetStatePower() << 2) + (EV_OUTPUTS_GetStateLED2() << 1) + (EV_OUTPUTS_GetStateLED1() << 0)));
										EV_UART_SendString("\r\n");
										break;
									}
									case 11: { // GET STATUS OF INPUT
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", ((EV_INPUTS_GetStateSwitchLockDevice() << 1) + (EV_INPUTS_GetStateSwitchStartCharging() << 0)));
										EV_UART_SendString("\r\n");
										break;
									}
									case 12: { // GET ADC-value of pos. Ucp
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", pilotPositiveADCValue);
										EV_UART_SendString("\r\n");
										break;
									}
									case 13: { // GET ADC-value of neg. Ucp
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", (0xFFF - pilotNegativeADCValue));
										EV_UART_SendString("\r\n");
										break;
									}
									case 14: { // GET ADC-value of Ucs
										break;
									}
									case 15: { // GET Ic - PWM duty cycle
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", (int)(evPwmDutyCycle * 10));
										EV_UART_SendString("\r\n");
										break;
									}
									case 18: { // Get Idefault
										EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
										EV_UART_SendStringFormat(" %d", (int)((float)settingsData.selectedIdefault * 10));
										EV_UART_SendString("\r\n");
										break;
									}
									case 19: { // Switch PWM on
										if (selectedModuleMode == kEvModuleModeManual) {
											if (!pwmRunning) EV_PWM_Start();

											EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
											EV_UART_SendString("\r\n");
										} else {
											evUartShowCommandError = true;
										}
										break;
									}
									case 20: { // Switch PWM off
										if (selectedModuleMode == kEvModuleModeManual) {
											if (pwmRunning) EV_PWM_Stop();

											EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
											EV_UART_SendString("\r\n");
										} else {
											evUartShowCommandError = true;
										}
										break;
									}
									case 21: { // Get PWM State
										if (pwmRunning == true) {
											EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
											EV_UART_SendString(" 1");
											EV_UART_SendString("\r\n");
										} else {
											EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
											EV_UART_SendString(" 0");
											EV_UART_SendString("\r\n");
										}
										break;
									}
									case 22: { // Start charging
										if (selectedModuleMode == kEvModuleModeManual) {
											if (currentStateMachine == EV_State_B1 || currentStateMachine == EV_State_B2) {
												manualStartChargingFlag = true;
												
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else if (currentStateMachine == EV_State_C1 || currentStateMachine == EV_State_D2) {
												if (currentStateMachine == EV_State_C1) {
													EV_State_C2();
												} else if (currentStateMachine == EV_State_D1) {
													EV_State_D2();
												}
												
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else {
												evUartShowCommandError = true;
											}
										} else {
											evUartShowCommandError = true;
										}
										break;
									}
									case 23: { // Stop charging
										if (selectedModuleMode == kEvModuleModeManual) {
											if (currentStateMachine == EV_State_C2 || currentStateMachine == EV_State_D2) {
												if (currentStateMachine == EV_State_C2) {
													EV_State_C1();
												} else if (currentStateMachine == EV_State_D2) {
													EV_State_D1();
												}
												
												EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
												EV_UART_SendString("\r\n");
											} else {
												evUartShowCommandError = true;
											}
										} else {
											evUartShowCommandError = true;
										}
										break;
									}
									default: { // THIS FUNCTION DOESNT EXISTS
										evUartShowCommandError = true;
										break;
									}
								}
							} else { // FUNCTION NOT CORRECT
								evUartShowCommandError = true;
							}
						}
					} else {
						// MODULE ADDRESS NOT CORRECT
					}
				} else {
					// MODULE ADDRESS NOT CORRECT
				}
			} else { // COMMAND ERROR
				evUartShowCommandError = true;
			}
			
			if (evUartShowCommandError == true) {
				evUartShowCommandError = false;
				
				EV_UART_SendStringFormat("%c%d %02d", EV_UART_SEND_CHARACTER, settingsData.selectedModuleAddress, evUartFunctionNumber);
				EV_UART_SendString(" ERROR");
				EV_UART_SendString("\r\n");
			}
			
			// Set to default
			evUartModuleAddressSpaceIndex = 0; evUartFunctionSpaceIndex = 0;
			evUartModuleAddressNumber = 0; evUartFunctionNumber = 0, evUartValueNumber = 0;
			
			// Free pointer
			if (evUartModuleAddressString != NULL) { free(evUartModuleAddressString); evUartModuleAddressString = NULL; }
			if (evUartFunctionString != NULL) { free(evUartFunctionString); evUartFunctionString = NULL; }
			if (evUartValueString != NULL) { free(evUartValueString); evUartValueString = NULL; }
		}
	}
}
